<!-- Pandas  -->

# Pandas

In [2]:
import numpy as np
import pandas as pd

In [3]:
# series - one dimenstion array object

data = [1,2,3,4]

series = pd.Series(data)
print(series)
type(series)

0    1
1    2
2    3
3    4
dtype: int64

pandas.core.series.Series

In [4]:
# create a series from dictionary

data = {
    'a':1,
    'b':2,
    'c':3,
    'd':4
}

series = pd.Series(data)
print(series)
print(type(series))

a    1
b    2
c    3
d    4
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
data = [10,20,30]
new_index = ['a','b','c']

pd.Series(data,index = new_index)

a    10
b    20
c    30
dtype: int64

In [6]:
# DataFrame - 2d
# create a dataframe from dictionary

data = {
    # colname     values
    'Name' : ['Wasif','Hossain','Jhony'],
    'Age' : [23,18,15],
    'City' : ['New york','Uttara','Sydney']
}

df = pd.DataFrame(data)
display(df)
print(type(df))

      Name  Age      City
0    Wasif   23  New york
1  Hossain   18    Uttara
2    Jhony   15    Sydney

<class 'pandas.core.frame.DataFrame'>

In [7]:
# convert the df into array

np.array(df)

array([['Wasif', 23, 'New york'],
       ['Hossain', 18, 'Uttara'],
       ['Jhony', 15, 'Sydney']], dtype=object)

In [8]:
# create df form list of dict

data = [
    {"Name": "Wasif", "Age": 23, "City": "Dhaka"},
    {"Name": "Sunny", "Age": 23, "City": "Dhaka"},
    {"Name": "Rejoan", "Age": 23, "City": "Dhaka"},
    {"Name": "Hasan", "Age": 23, "City": "Dhaka"},
    {"Name": "Galib", "Age": 23, "City": "Dhaka"}
]

df = pd.DataFrame(data)
display(df)
print(type(df))

     Name  Age   City
0   Wasif   23  Dhaka
1   Sunny   23  Dhaka
2  Rejoan   23  Dhaka
3   Hasan   23  Dhaka
4   Galib   23  Dhaka

<class 'pandas.core.frame.DataFrame'>

In [9]:
df = pd.read_csv("titanic.csv")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [10]:
# we can directly access column like this

# df['embark_town'] and it will become series
df['embark_town'].head()

0    Southampton
1      Cherbourg
2    Southampton
3    Southampton
4    Southampton
Name: embark_town, dtype: object

In [11]:
data = [
    {"Name": "John", "Age": 22, "City": "Dhaka"},
    {"Name": "Jack", "Age": 24, "City": "Chattogram"},
    {"Name": "Emily", "Age": 21, "City": "Sylhet"},
    {"Name": "Sophia", "Age": 23, "City": "Rajshahi"},
    {"Name": "Michael", "Age": 25, "City": "Khulna"}
]
df = pd.DataFrame(data)
df

      Name  Age        City
0     John   22       Dhaka
1     Jack   24  Chattogram
2    Emily   21      Sylhet
3   Sophia   23    Rajshahi
4  Michael   25      Khulna

In [12]:
df.loc[0]["Name"]

'John'

In [13]:
df.iloc[2]

Name     Emily
Age         21
City    Sylhet
Name: 2, dtype: object

In [14]:
df.iloc[2][1]

C:\Users\ASUS\AppData\Local\Temp\ipykernel_4172\2023769522.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[2][1]

np.int64(21)

In [15]:
# adding a column 

df['Salary'] = [2,3,4,5,6]
df

      Name  Age        City  Salary
0     John   22       Dhaka       2
1     Jack   24  Chattogram       3
2    Emily   21      Sylhet       4
3   Sophia   23    Rajshahi       5
4  Michael   25      Khulna       6

In [16]:
# two ways to make it permanent drop
# df = df.drop('Salary', axis=1)
# df.drop('Salary', axis=1 , inplace=True)
# x axis or row axis = 0
# y axis or col axis = 1
df.drop('Salary', axis=1)

      Name  Age        City
0     John   22       Dhaka
1     Jack   24  Chattogram
2    Emily   21      Sylhet
3   Sophia   23    Rajshahi
4  Michael   25      Khulna

In [17]:
df

      Name  Age        City  Salary
0     John   22       Dhaka       2
1     Jack   24  Chattogram       3
2    Emily   21      Sylhet       4
3   Sophia   23    Rajshahi       5
4  Michael   25      Khulna       6

In [18]:
df.drop('Salary', axis=1, inplace=True)

In [19]:
df

      Name  Age        City
0     John   22       Dhaka
1     Jack   24  Chattogram
2    Emily   21      Sylhet
3   Sophia   23    Rajshahi
4  Michael   25      Khulna

In [20]:
df["Age"] = df["Age"] + 1 # each of them
df

      Name  Age        City
0     John   23       Dhaka
1     Jack   25  Chattogram
2    Emily   22      Sylhet
3   Sophia   24    Rajshahi
4  Michael   26      Khulna

In [21]:
# stastistical analysis or five number summary 

df.describe()

             Age
count   5.000000
mean   24.000000
std     1.581139
min    22.000000
25%    23.000000
50%    24.000000
75%    25.000000
max    26.000000

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   City    5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

### Data Manipulation

In [39]:
data = pd.read_csv("data.csv")
display(data.sample(10))
print(data.info())
print(data.describe())

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
16  2023-01-17        C   93.0  Product2  511.0  South
7   2023-01-08        C   89.0  Product1  488.0   West
21  2023-01-22        C   37.0  Product2  992.0  South
41  2023-02-11        C   97.0  Product1  256.0   East
28  2023-01-29        B    NaN  Product3  617.0  North
1   2023-01-02        B   39.0  Product3  110.0  North
20  2023-01-21        C   82.0  Product3  606.0  South
2   2023-01-03        C   32.0  Product2  398.0   East
23  2023-01-24        C   92.0  Product2  342.0   West

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      50 non-null     object
 1   Category  50 non-null     object
 2   Value     47 non-null     float64
 3   Product   50 non-null     object
 4   Sales     46 non-null     float64
 5   Region    50 non-null     object
dtypes: float64(2), object(4)
memory usage: 2.5+ KB
None
           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [30]:
# handling missing values 

data.isnull()

     Date  Category  Value  Product  Sales  Region
0   False     False  False    False  False   False
1   False     False  False    False  False   False
2   False     False  False    False  False   False
3   False     False  False    False  False   False
4   False     False  False    False  False   False
5   False     False  False    False  False   False
6   False     False  False    False  False   False
7   False     False  False    False  False   False
8   False     False  False    False  False   False
9   False     False  False    False  False   False
10  False     False  False    False  False   False
11  False     False  False    False   True   False
12  False     False  False    False  False   False
13  False     False  False    False  False   False
14  False     False  False    False  False   False
15  False     False   True    False  False   False
16  False     False  False    False  False   False
17  False     False   True    False  False   False
18  False     False  False    False  False   False
19  False     False  False    False  False   False
20  False     False  False    False  False   False
21  False     False  False    False  False   False
22  False     False  False    False  False   False
23  False     False  False    False  False   False
24  False     False  False    False  False   False
25  False     False  False    False  False   False
26  False     False  False    False  False   False
27  False     False  False    False  False   False
28  False     False   True    False  False   False
29  False     False  False    False  False   False
30  False     False  False    False  False   False
31  False     False  False    False  False   False
32  False     False  False    False  False   False
33  False     False  False    False   True   False
34  False     False  False    False  False   False
35  False     False  False    False   True   False
36  False     False  False    False  False   False
37  False     False  False    False   True   False
38  False     False  False    False  False   False
39  False     False  False    False  False   False
40  False     False  False    False  False   False
41  False     False  False    False  False   False
42  False     False  False    False  False   False
43  False     False  False    False  False   False
44  False     False  False    False  False   False
45  False     False  False    False  False   False
46  False     False  False    False  False   False
47  False     False  False    False  False   False
48  False     False  False    False  False   False
49  False     False  False    False  False   False

In [31]:
data.isnull().sum()

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

In [41]:
data2 = data.fillna(0)
data2.isnull().sum()
data2.sample(10)

          Date Category  Value   Product  Sales Region
16  2023-01-17        C   93.0  Product2  511.0  South
19  2023-01-20        A   59.0  Product1  736.0   East
4   2023-01-05        B   26.0  Product3  869.0  North
23  2023-01-24        C   92.0  Product2  342.0   West
44  2023-02-14        A   96.0  Product3  830.0   East
1   2023-01-02        B   39.0  Product3  110.0  North
20  2023-01-21        C   82.0  Product3  606.0  South
8   2023-01-09        C   37.0  Product3  772.0   West
13  2023-01-14        A   69.0  Product1  423.0   East
33  2023-02-03        C   27.0  Product3    0.0   East

In [44]:
# filling the null using mean 

data["Sales_Filled"] = data["Sales"].fillna(data['Sales'].mean())
data.head(20)

          Date Category  Value   Product  Sales Region  Sales_Filled
0   2023-01-01        A   28.0  Product1  754.0   East    754.000000
1   2023-01-02        B   39.0  Product3  110.0  North    110.000000
2   2023-01-03        C   32.0  Product2  398.0   East    398.000000
3   2023-01-04        B    8.0  Product1  522.0   East    522.000000
4   2023-01-05        B   26.0  Product3  869.0  North    869.000000
5   2023-01-06        B   54.0  Product3  192.0   West    192.000000
6   2023-01-07        A   16.0  Product1  936.0   East    936.000000
7   2023-01-08        C   89.0  Product1  488.0   West    488.000000
8   2023-01-09        C   37.0  Product3  772.0   West    772.000000
9   2023-01-10        A   22.0  Product2  834.0   West    834.000000
10  2023-01-11        B    7.0  Product1  842.0  North    842.000000
11  2023-01-12        B   60.0  Product2    NaN   West    557.130435
12  2023-01-13        A   70.0  Product3  628.0  South    628.000000
13  2023-01-14        A   69.0  Product1  423.0   East    423.000000
14  2023-01-15        A   47.0  Product2  893.0   West    893.000000
15  2023-01-16        C    NaN  Product1  895.0  North    895.000000
16  2023-01-17        C   93.0  Product2  511.0  South    511.000000
17  2023-01-18        C    NaN  Product1  108.0   West    108.000000
18  2023-01-19        A   31.0  Product2  578.0   West    578.000000
19  2023-01-20        A   59.0  Product1  736.0   East    736.000000

In [46]:
data.dtypes

Date             object
Category         object
Value           float64
Product          object
Sales           float64
Region           object
Sales_Filled    float64
dtype: object

In [48]:
## renaming column

data.rename(columns={'Date': "Sale_Data"})

     Sale_Data Category  Value   Product  Sales Region  Sales_Filled
0   2023-01-01        A   28.0  Product1  754.0   East    754.000000
1   2023-01-02        B   39.0  Product3  110.0  North    110.000000
2   2023-01-03        C   32.0  Product2  398.0   East    398.000000
3   2023-01-04        B    8.0  Product1  522.0   East    522.000000
4   2023-01-05        B   26.0  Product3  869.0  North    869.000000
5   2023-01-06        B   54.0  Product3  192.0   West    192.000000
6   2023-01-07        A   16.0  Product1  936.0   East    936.000000
7   2023-01-08        C   89.0  Product1  488.0   West    488.000000
8   2023-01-09        C   37.0  Product3  772.0   West    772.000000
9   2023-01-10        A   22.0  Product2  834.0   West    834.000000
10  2023-01-11        B    7.0  Product1  842.0  North    842.000000
11  2023-01-12        B   60.0  Product2    NaN   West    557.130435
12  2023-01-13        A   70.0  Product3  628.0  South    628.000000
13  2023-01-14        A   69.0  Product1  423.0   East    423.000000
14  2023-01-15        A   47.0  Product2  893.0   West    893.000000
15  2023-01-16        C    NaN  Product1  895.0  North    895.000000
16  2023-01-17        C   93.0  Product2  511.0  South    511.000000
17  2023-01-18        C    NaN  Product1  108.0   West    108.000000
18  2023-01-19        A   31.0  Product2  578.0   West    578.000000
19  2023-01-20        A   59.0  Product1  736.0   East    736.000000
20  2023-01-21        C   82.0  Product3  606.0  South    606.000000
21  2023-01-22        C   37.0  Product2  992.0  South    992.000000
22  2023-01-23        B   62.0  Product3  942.0  North    942.000000
23  2023-01-24        C   92.0  Product2  342.0   West    342.000000
24  2023-01-25        A   24.0  Product2  458.0   East    458.000000
25  2023-01-26        C   95.0  Product1  584.0   West    584.000000
26  2023-01-27        C   71.0  Product2  619.0  North    619.000000
27  2023-01-28        C   56.0  Product2  224.0  North    224.000000
28  2023-01-29        B    NaN  Product3  617.0  North    617.000000
29  2023-01-30        C   51.0  Product2  737.0  South    737.000000
30  2023-01-31        B   50.0  Product3  735.0   West    735.000000
31  2023-02-01        A   17.0  Product2  189.0   West    189.000000
32  2023-02-02        B   63.0  Product3  338.0  South    338.000000
33  2023-02-03        C   27.0  Product3    NaN   East    557.130435
34  2023-02-04        C   70.0  Product3  669.0   West    669.000000
35  2023-02-05        B   60.0  Product2    NaN   West    557.130435
36  2023-02-06        C   36.0  Product3  177.0   East    177.000000
37  2023-02-07        C    2.0  Product1    NaN  North    557.130435
38  2023-02-08        C   94.0  Product1  408.0  South    408.000000
39  2023-02-09        A   62.0  Product1  155.0   West    155.000000
40  2023-02-10        B   15.0  Product1  578.0   East    578.000000
41  2023-02-11        C   97.0  Product1  256.0   East    256.000000
42  2023-02-12        A   93.0  Product3  164.0   West    164.000000
43  2023-02-13        A   43.0  Product3  949.0   East    949.000000
44  2023-02-14        A   96.0  Product3  830.0   East    830.000000
45  2023-02-15        B   99.0  Product2  599.0   West    599.000000
46  2023-02-16        B    6.0  Product1  938.0  South    938.000000
47  2023-02-17        B   69.0  Product3  143.0   West    143.000000
48  2023-02-18        C   65.0  Product3  182.0  North    182.000000
49  2023-02-19        C   11.0  Product3  708.0  North    708.000000

In [49]:
## change data type

data["Sales_Filled_int"] = data["Sales_Filled"].astype(int)

In [50]:
data

,Date,Category,Value,Product,Sales,Region,Sales_Filled,Sales_Filled_int
0,2023-01-01,A,28.0,Product1,754.0,East,754.000000,754
1,2023-01-02,B,39.0,Product3,110.0,North,110.000000,110
2,2023-01-03,C,32.0,Product2,398.0,East,398.000000,398
3,2023-01-04,B,8.0,Product1,522.0,East,522.000000,522
4,2023-01-05,B,26.0,Product3,869.0,North,869.000000,869
5,2023-01-06,B,54.0,Product3,192.0,West,192.000000,192
6,2023-01-07,A,16.0,Product1,936.0,East,936.000000,936
7,2023-01-08,C,89.0,Product1,488.0,West,488.000000,488
8,2023-01-09,C,37.0,Product3,772.0,West,772.000000,772
9,2023-01-10,A,22.0,Product2,834.0,West,834.000000,834
10,2023-01-11,B,7.0,Product1,842.0,North,842.000000,842
11,2023-01-12,B,60.0,Product2,NaN,West,557.130435,557
12,2023-01-13,A,70.0,Product3,628.0,South,628.000000,628
13,2023-01-14,A,69.0,Product1,423.0,East,423.000000,423
14,2023-01-15,A,47.0,Product2,893.0,West,893.000000,893
15,2023-01-16,C,NaN,Product1,895.0,North,895.000000,895
16,2023-01-17,C,93.0,Product2,511.0,South,511.000000,511
17,2023-01-18,C,NaN,Product1,108.0,West,108.000000,108
18,2023-01-19,A,31.0,Product2,578.0,West,578.000000,578
19,2023-01-20,A,59.0,Product1,736.0,East,736.000000,736
20,2023-01-21,C,82.0,Product3,606.0,South,606.000000,606
21,2023-01-22,C,37.0,Product2,992.0,South,992.000000,992
22,2023-01-23,B,62.0,Product3,942.0,North,942.000000,942
23,2023-01-24,C,92.0,Product2,342.0,West,342.000000,342
24,2023-01-25,A,24.0,Product2,458.0,East,458.000000,458
25,2023-01-26,C,95.0,Product1,584.0,West,584.000000,584
26,2023-01-27,C,71.0,Product2,619.0,North,619.000000,619
27,2023-01-28,C,56.0,Product2,224.0,North,224.000000,224
28,2023-01-29,B,NaN,Product3,617.0,North,617.000000,617
29,2023-01-30,C,51.0,Product2,737.0,South,737.000000,737
30,2023-01-31,B,50.0,Product3,735.0,West,735.000000,735
31,2023-02-01,A,17.0,Product2,189.0,West,189.000000,189
32,2023-02-02,B,63.0,Product3,338.0,South,338.000000,338
33,2023-02-03,C,27.0,Product3,NaN,East,557.130435,557
34,2023-02-04,C,70.0,Product3,669.0,West,669.000000,669
35,2023-02-05,B,60.0,Product2,NaN,West,557.130435,557
36,2023-02-06,C,36.0,Product3,177.0,East,177.000000,177
37,2023-02-07,C,2.0,Product1,NaN,North,557.130435,557
38,2023-02-08,C,94.0,Product1,408.0,South,408.000000,408
39,2023-02-09,A,62.0,Product1,155.0,West,155.000000,155
40,2023-02-10,B,15.0,Product1,578.0,East,578.000000,578
41,2023-02-11,C,97.0,Product1,256.0,East,256.000000,256
42,2023-02-12,A,93.0,Product3,164.0,West,164.000000,164
43,2023-02-13,A,43.0,Product3,949.0,East,949.000000,949
44,2023-02-14,A,96.0,Product3,830.0,East,830.000000,830
45,2023-02-15,B,99.0,Product2,599.0,West,599.000000,599
46,2023-02-16,B,6.0,Product1,938.0,South,938.000000,938
47,2023-02-17,B,69.0,Product3,143.0,West,143.000000,143
48,2023-02-18,C,65.0,Product3,182.0,North,182.000000,182
49,2023-02-19,C,11.0,Product3,708.0,North,708.000000,708

In [51]:
# handle missing values

data['Value'] = data["Value"].fillna(data["Value"].mean()).astype(int)

In [52]:
data.head()

,Date,Category,Value,Product,Sales,Region,Sales_Filled,Sales_Filled_int
0,2023-01-01,A,28,Product1,754.0,East,754.0,754
1,2023-01-02,B,39,Product3,110.0,North,110.0,110
2,2023-01-03,C,32,Product2,398.0,East,398.0,398
3,2023-01-04,B,8,Product1,522.0,East,522.0,522
4,2023-01-05,B,26,Product3,869.0,North,869.0,869

In [ ]:
# how to apply function any column
# suppose I want to double the value in a new col

def double(item):
    return item * 2


data["Value_2x"] = data["Value"].apply(double)
# or data["Value_2x"] = data["Value"].apply(lambda x: x * 2) 
data.head()

,Date,Category,Value,Product,Sales,Region,Sales_Filled,Sales_Filled_int,Value_2x
0,2023-01-01,A,28,Product1,754.0,East,754.0,754,56
1,2023-01-02,B,39,Product3,110.0,North,110.0,110,78
2,2023-01-03,C,32,Product2,398.0,East,398.0,398,64
3,2023-01-04,B,8,Product1,522.0,East,522.0,522,16
4,2023-01-05,B,26,Product3,869.0,North,869.0,869,52

In [55]:
# Data aggregating and grouping

grp_mean = data.groupby('Product')['Value'].mean()
grp_mean

Product
Product1    46.812500
Product2    52.800000
Product3    54.947368
Name: Value, dtype: float64

In [57]:
# if i need to group by by two categorical parameter 

grp2 = data.groupby(['Product','Region'])["Value"].sum()
grp2

Product   Region
Product1  East      292
          North      60
          South     100
          West      297
Product2  East       56
          North     127
          South     181
          West      428
Product3  East      202
          North     254
          South     215
          West      373
Name: Value, dtype: int64

In [58]:
grp2 = data.groupby(['Product','Region'])["Value"].mean()
grp2

Product   Region
Product1  East      41.714286
          North     20.000000
          South     50.000000
          West      74.250000
Product2  East      28.000000
          North     63.500000
          South     60.333333
          West      53.500000
Product3  East      50.500000
          North     42.333333
          South     71.666667
          West      62.166667
Name: Value, dtype: float64

In [61]:
# multiple aggregate function 

grp2 = data.groupby('Region')["Value"].agg(['mean','sum','count'])
grp2

             mean   sum  count
Region
East    42.307692   550     13
North   40.090909   441     11
South   62.000000   496      8
West    61.000000  1098     18

In [66]:
# merging and joining data frame

df1 = pd.DataFrame({'Key':["A",'B','C'],'Value1':[1,2,3]})
df2 = pd.DataFrame({'Key':["A",'B','D'],'Value1':[4,5,6]})

display(df1)
display(df2)

  Key  Value1
0   A       1
1   B       2
2   C       3

  Key  Value1
0   A       4
1   B       5
2   D       6

In [68]:
pd.merge(df1,df2,on="Key",how="inner")

  Key  Value1_x  Value1_y
0   A         1         4
1   B         2         5

In [69]:
pd.merge(df1,df2,on="Key",how="outer")

  Key  Value1_x  Value1_y
0   A       1.0       4.0
1   B       2.0       5.0
2   C       3.0       NaN
3   D       NaN       6.0

In [70]:
pd.merge(df1,df2,on="Key",how="left")

  Key  Value1_x  Value1_y
0   A         1       4.0
1   B         2       5.0
2   C         3       NaN

In [71]:
pd.merge(df1,df2,on="Key",how="right")

  Key  Value1_x  Value1_y
0   A       1.0         4
1   B       2.0         5
2   D       NaN         6

### Read Data from Various Source

In [73]:
# https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data 
# online dataset link 

df = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data")
df.to_csv("wine.csv")

In [74]:
df

,1,14.23,1.71,2.43,15.6,127,2.8,3.06,.28,2.29,5.64,1.04,3.92,1065
0,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
1,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
2,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
3,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735
4,1,14.20,1.76,2.45,15.2,112,3.27,3.39,0.34,1.97,6.75,1.05,2.85,1450
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
172,3,13.71,5.65,2.45,20.5,95,1.68,0.61,0.52,1.06,7.70,0.64,1.74,740
173,3,13.40,3.91,2.48,23.0,102,1.80,0.75,0.43,1.41,7.30,0.70,1.56,750
174,3,13.27,4.28,2.26,20.0,120,1.59,0.69,0.43,1.35,10.20,0.59,1.56,835
175,3,13.17,2.59,2.37,20.0,120,1.65,0.68,0.53,1.46,9.30,0.60,1.62,840
176,3,14.13,4.10,2.74,24.5,96,2.05,0.76,0.56,1.35,9.20,0.61,1.60,560

In [ ]:
# collecting data from Website 

%pip install lxml
%pip install html5lib
%pip install beautifulsoup4

Collecting lxml
  Downloading lxml-5.4.0-cp312-cp312-win_amd64.whl.metadata (3.6 kB)
Downloading lxml-5.4.0-cp312-cp312-win_amd64.whl (3.8 MB)
   ---------------------------------------- 0.0/3.8 MB ? eta -:--:--
   -- ------------------------------------- 0.3/3.8 MB ? eta -:--:--
   -------- ------------------------------- 0.8/3.8 MB 2.2 MB/s eta 0:00:02
   ---------- ----------------------------- 1.0/3.8 MB 2.0 MB/s eta 0:00:02
   ---------------- ----------------------- 1.6/3.8 MB 2.0 MB/s eta 0:00:02
   ------------------- -------------------- 1.8/3.8 MB 1.9 MB/s eta 0:00:02
   --------------------- ------------------ 2.1/3.8 MB 1.8 MB/s eta 0:00:01
   ------------------------ --------------- 2.4/3.8 MB 1.8 MB/s eta 0:00:01
   ------------------------------ --------- 2.9/3.8 MB 1.7 MB/s eta 0:00:01
   -------------------------------- ------- 3.1/3.8 MB 1.7 MB/s eta 0:00:01
   ----------------------------------- ---- 3.4/3.8 MB 1.6 MB/s eta 0:00:01
   -------------------------------------- - 3.7/3.8 MB 1.6 MB/s eta 0:00:01
   ---------------------------------------- 3.8/3.8 MB 1.6 MB/s eta 0:00:00
Installing collected packages: lxml
Successfully installed lxml-5.4.0
Note: you may need to restart the kernel to use updated packages.
Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl.metadata (16 kB)
Requirement already satisfied: six>=1.9 in w:\ai_learning\dskn\advance-python-for-data-science-odyssey\env312\lib\site-packages (from html5lib) (1.17.0)
Collecting webencodings (from html5lib)
  Using cached webencodings-0.5.1-py2.py3-none-any.whl.metadata (2.1 kB)
Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
Using cached webencodings-0.5.1-py2.py3-none-any.whl (11 kB)
Installing collected packages: webencodings, html5lib
Successfully installed html5lib-1.1 webencodings-0.5.1
Note: you may need to restart the kernel to use updated packages.
Collecting beautifulsoup4
  Downloading beautifulsoup4-4.13.4-py3-none-any.whl.metadata (3.8 kB)
Collecting soupsieve>1.2 (from beautifulsoup4)
  Downloading soupsieve-2.7-py3-none-any.whl.metadata (4.6 kB)
Collecting typing-extensions>=4.0.0 (from beautifulsoup4)
  Using cached typing_extensions-4.13.2-py3-none-any.whl.metadata (3.0 kB)
Downloading beautifulsoup4-4.13.4-py3-none-any.whl (187 kB)
Downloading soupsieve-2.7-py3-none-any.whl (36 kB)
Using cached typing_extensions-4.13.2-py3-none-any.whl (45 kB)
Installing collected packages: typing-extensions, soupsieve, beautifulsoup4
Successfully installed beautifulsoup4-4.13.4 soupsieve-2.7 typing-extensions-4.13.2
Note: you may need to restart the kernel to use updated packages.

In [81]:
# from html 
# www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list


url="https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/"


df = pd.read_html(url)
display(df)

[                               Bank Name               City         State  \
 0                   Pulaski Savings Bank            Chicago      Illinois
 1     The First National Bank of Lindsay            Lindsay      Oklahoma
 2  Republic First Bank dba Republic Bank       Philadelphia  Pennsylvania
 3                          Citizens Bank           Sac City          Iowa
 4               Heartland Tri-State Bank            Elkhart        Kansas
 5                    First Republic Bank      San Francisco    California
 6                         Signature Bank           New York      New York
 7                    Silicon Valley Bank        Santa Clara    California
 8                      Almena State Bank             Almena        Kansas
 9             First City Bank of Florida  Fort Walton Beach       Florida

     Cert                Acquiring Institution      Closing Date  \
 0  28611                      Millennium Bank  January 17, 2025
 1   4134   First Bank & Trust Co., Duncan, OK  October 18, 2024
 2  27332    Fulton Bank, National Association    April 26, 2024
 3   8758            Iowa Trust & Savings Bank  November 3, 2023
 4  25851               Dream First Bank, N.A.     July 28, 2023
 5  59017            JPMorgan Chase Bank, N.A.       May 1, 2023
 6  57053                  Flagstar Bank, N.A.    March 12, 2023
 7  24735  First Citizens Bank & Trust Company    March 10, 2023
 8  15426                          Equity Bank  October 23, 2020
 9  16748            United Fidelity Bank, fsb  October 16, 2020

    Fund  Sort ascending
 0                 10548
 1                 10547
 2                 10546
 3                 10545
 4                 10544
 5                 10543
 6                 10540
 7                 10539
 8                 10538
 9                 10537  ]

In [82]:
df[0]

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
1,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
2,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
3,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
4,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
5,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
6,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
7,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
8,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
9,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537

In [87]:
url = "https://en.wikipedia.org/wiki/List_of_countries_and_dependencies_by_population"
df = pd.read_html(url,match="List of countries and territories by total population",header=0)
df[0]

,Location,Population,% of world,Date,Source (official or from the United Nations),Notes
0,World,8138506850,100%,20 Apr 2025,UN projection[1][3],NaN
1,India,1413324000,17.3%,1 Mar 2025,Official projection[4],[b]
2,China,1408280000,17.2%,31 Dec 2024,Official estimate[5],[c]
3,United States,340110988,4.2%,1 Jul 2024,Official estimate[6],[d]
4,Indonesia,282477584,3.5%,30 Jun 2024,National annual projection[7],NaN
...,...,...,...,...,...,...
235,Niue (New Zealand),1681,0%,11 Nov 2022,2022 Census[247],NaN
236,Tokelau (New Zealand),1647,0%,1 Jan 2019,2019 Census[248],NaN
237,Vatican City,882,0%,31 Dec 2024,Official figure[249],[ah]
238,Cocos (Keeling) Islands (Australia),593,0%,30 Jun 2020,2021 Census[250],NaN
239,Pitcairn Islands (UK),35,0%,1 Jul 2023,Official estimate[251],NaN